#include <math.h>
#include <stdio.h>

int main()
{

    int n; //вихідне значення - кількість членів послідовності
    do
    {
        printf("введіть значення кількості членів послідовності n>0: ");
        scanf("%d", &n);
    } while (n <= 0);

    int i;       //індекс поточного члену послідовності
    float xi;    //поточний член послідовності
    float p = 1; //поточне значення добутку
    float s = 0; //поточне значення множнику-(поточної суми елементів)

    printf("значення членів послідовності у наступному порядку:\n");
    printf("спочатку x[n], потім x[n-1], потім x[n-2], ..., і так далі, а в кінці x[1]\n");

    for (i = n; i > 0; i--)
    {
        printf("введіть значення %d-го члену послідовності x[%d]: ", i, i);
        scanf("%f", &xi);

        s += xi;
        p *= s;

        printf("поточне значення s[%d] = %f \n", i, s);
        printf("поточне значення p[%d] = %f \n", i, p);
    }

    printf("шукане значення p = %f \n", p);

    return 0;
}
